nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxl255/common/pin_mux/cm0plus/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitI2CPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitI2CPins(void)
{
    /* Port Clock Enable: Enable */
    CLOCK_EnableClock(kCLOCK_GateAonPORT);
    /* AON__LPI2C0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kAonI2C_RST_SHIFT_RSTn);
    /* AON__KPP0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kAonKPP_RST_SHIFT_RSTn);
    /* AON__LPADC0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kAonLPADC_RST_SHIFT_RSTn);

    const port_pin_config_t port0_12_pinC14_config = {/* Internal pull-up resistor is enabled */
                                                      kPORT_PullUp,
                                                      /* Low internal pull resistor value is selected. */
                                                      kPORT_LowPullResistor,
                                                      /* Fast slew rate is configured */
                                                      kPORT_FastSlewRate,
                                                      /* Passive input filter is disabled */
                                                      kPORT_PassiveFilterDisable,
                                                      /* Open drain output is disabled */
                                                      kPORT_OpenDrainDisable,
                                                      /* Low drive strength is configured */
                                                      kPORT_LowDriveStrength,
                                                      /* Normal drive strength is configured */
                                                      kPORT_NormalDriveStrength,
                                                      /* Pin is configured as AON_LPI2C0_SCL */
                                                      kPORT_MuxAlt2,
                                                      /* Digital input enabled */
                                                      kPORT_InputBufferEnable,
                                                      /* Digital input is not inverted */
                                                      kPORT_InputNormal,
                                                      /* Pin Control Register fields [15:0] are not locked */
                                                      kPORT_UnlockRegister};
    /* PORT0_12 (pin C14) is configured as AON_LPI2C0_SCL */
    PORT_SetPinConfig(AON__PORT0, 12U, &port0_12_pinC14_config);

    const port_pin_config_t port0_13_pinA12_config = {/* Internal pull-up resistor is enabled */
                                                      kPORT_PullUp,
                                                      /* Low internal pull resistor value is selected. */
                                                      kPORT_LowPullResistor,
                                                      /* Fast slew rate is configured */
                                                      kPORT_FastSlewRate,
                                                      /* Passive input filter is disabled */
                                                      kPORT_PassiveFilterDisable,
                                                      /* Open drain output is disabled */
                                                      kPORT_OpenDrainDisable,
                                                      /* Low drive strength is configured */
                                                      kPORT_LowDriveStrength,
                                                      /* Normal drive strength is configured */
                                                      kPORT_NormalDriveStrength,
                                                      /* Pin is configured as AON_LPI2C0_SDA */
                                                      kPORT_MuxAlt2,
                                                      /* Digital input enabled */
                                                      kPORT_InputBufferEnable,
                                                      /* Digital input is not inverted */
                                                      kPORT_InputNormal,
                                                      /* Pin Control Register fields [15:0] are not locked */
                                                      kPORT_UnlockRegister};
    /* PORT0_13 (pin A12) is configured as AON_LPI2C0_SDA */
    PORT_SetPinConfig(AON__PORT0, 13U, &port0_13_pinA12_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitACMPPins:
- options: {callFromInitBoot: 'false', coreID: cm0plus, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: F15, peripheral: AON__ACMP0, signal: 'IN, 3N', pin_signal: P0_4/AON_LPI2C0_SCL/KPP_ROW_2/LPTMR0_ALT0/LCSenseCMP_CH3/AON_LPACMP_IN_3/AON_ACMP0_IN3, slew_rate: fast,
    open_drain: disable, drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low, input_buffer: disable,
    invert_input: normal}
  - {pin_num: F15, peripheral: AON__ACMP0, signal: 'IN, 3P', pin_signal: P0_4/AON_LPI2C0_SCL/KPP_ROW_2/LPTMR0_ALT0/LCSenseCMP_CH3/AON_LPACMP_IN_3/AON_ACMP0_IN3, slew_rate: fast,
    open_drain: disable, drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low, input_buffer: disable,
    invert_input: normal}
  - {pin_num: F15, peripheral: AON__LPACMP, signal: 'IN, 3N', pin_signal: P0_4/AON_LPI2C0_SCL/KPP_ROW_2/LPTMR0_ALT0/LCSenseCMP_CH3/AON_LPACMP_IN_3/AON_ACMP0_IN3,
    slew_rate: fast, open_drain: disable, drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low,
    input_buffer: disable, invert_input: normal}
  - {pin_num: F15, peripheral: AON__LPACMP, signal: 'IN, 5P', pin_signal: P0_4/AON_LPI2C0_SCL/KPP_ROW_2/LPTMR0_ALT0/LCSenseCMP_CH3/AON_LPACMP_IN_3/AON_ACMP0_IN3,
    slew_rate: fast, open_drain: disable, drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low,
    input_buffer: disable, invert_input: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

